In [1]:
'''  
Target Guided Ordinal Encoding 
Converting Categorical variables into numerical variables
based on the relation relationship of categorical variables with target variables
--->Based on the mean or median of the category
---> It is useful when we have categorical variables with large number of unique categories
'''

'  \nTarget Guided Ordinal Encoding \nConverting Categorical variables into numerical variables\nbased on the relation relationship of categorical variables with target variables\n\n---> It is useful when we have categorical variables with large number of unique categories\n'

In [3]:
import pandas as pd
df=pd.DataFrame({
    "city":["New York","London","Paris","Tokyo","New York","paris"],
    "price":[200,150,300,250,180,320]
})

In [4]:
df

       city  price
0  New York    200
1    London    150
2     Paris    300
3     Tokyo    250
4  New York    180
5     paris    320

In [6]:
#by taking the mean or median of each category we are going to replace that with our categorical variables
#it can be simply done using group_by
mean_price=df.groupby("city")["price"].mean().to_dict()

In [7]:
mean_price

{'London': 150.0,
 'New York': 190.0,
 'Paris': 300.0,
 'Tokyo': 250.0,
 'paris': 320.0}

In [8]:
df

       city  price
0  New York    200
1    London    150
2     Paris    300
3     Tokyo    250
4  New York    180
5     paris    320

In [9]:
df["city_encoded"]=df["city"].map(mean_price)

In [10]:
df

       city  price  city_encoded
0  New York    200         190.0
1    London    150         150.0
2     Paris    300         300.0
3     Tokyo    250         250.0
4  New York    180         190.0
5     paris    320         320.0

In [12]:
df.drop("city",axis=1)

   price  city_encoded
0    200         190.0
1    150         150.0
2    300         300.0
3    250         250.0
4    180         190.0
5    320         320.0

In [11]:
#Now i dont want city feature to train my model 
df[["price","city_encoded"]]

   price  city_encoded
0    200         190.0
1    150         150.0
2    300         300.0
3    250         250.0
4    180         190.0
5    320         320.0